IRP/src/Documents/InventoryTransferOrder/InventoryTransferOrder.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>InventoryTransferOrder</name>

  <registerRecords>AccumulationRegister.R4035B_IncomingStocks</registerRecords>

  <registerRecords>AccumulationRegister.R4036B_IncomingStocksRequested</registerRecords>

  <registerRecords>AccumulationRegister.R4011B_FreeStocks</registerRecords>
  <registerRecords>AccumulationRegister.R4012B_StockReservation</registerRecords>
  <attributes>
    <name>Company</name>
    <type>
      <types>CatalogRef.Companies</types>
    </type>
  </attributes>
  <attributes>
    <name>Status</name>
    <type>
      <types>CatalogRef.ObjectStatuses</types>
    </type>
  </attributes>
  <attributes>
    <name>StoreReceiver</name>
    <type>
      <types>CatalogRef.Stores</types>
    </type>
  </attributes>
  <attributes>
    <name>StoreSender</name>
    <type>
      <types>CatalogRef.Stores</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ItemList</name>
    <attributes>
      <name>Key</name>
      <type>
        <types>DefinedType.typeRowID</types>
      </type>
    </attributes>
    <attributes>
      <name>ItemKey</name>
      <type>
        <types>CatalogRef.ItemKeys</types>
      </type>
    </attributes>
    <attributes>
      <name>Unit</name>
      <type>
        <types>CatalogRef.Units</types>
      </type>
    </attributes>
    <attributes>
      <name>Quantity</name>
      <type>
        <types>DefinedType.typeQuantity</types>
      </type>
    </attributes>
    <attributes>
      <name>InternalSupplyRequest</name>
      <type>
        <types>DocumentRef.InternalSupplyRequest</types>
      </type>
    </attributes>
    <attributes>
      <name>QuantityInBaseUnit</name>
      <type>
        <types>DefinedType.typeQuantity</types>
      </type>
    </attributes>
    <attributes>
      <name>PurchaseOrder</name>
      <type>
        <types>DocumentRef.PurchaseOrder</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>AddAttributes</name>
    <attributes>
      <name>Property</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.AddAttributeAndProperty</types>
      </type>
    </attributes>
    <attributes>
      <name>Value</name>
      <type>
        <types>Characteristic.AddAttributeAndProperty</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

IRP/src/AccumulationRegisters/R4035B_IncomingStocks/R4035B_IncomingStocks.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
 <name>R4035B_IncomingStocks</name>
 <resources>
  <name>Quantity</name>
  <type>
   <types>DefinedType.typeQuantity</types>
  </type>
 </resources>
 <dimensions>
  <name>Store</name>
  <type>
   <types>CatalogRef.Stores</types>
  </type>
 </dimensions>
 <dimensions>
  <name>ItemKey</name>
  <type>
   <types>CatalogRef.ItemKeys</types>
  </type>
 </dimensions>
 <dimensions>
  <name>Order</name>
  <type>
   <types>DocumentRef.PurchaseOrder</types>
   <types>DocumentRef.InventoryTransferOrder</types>
  </type>
 </dimensions>
</mdclass:AccumulationRegister>

IRP/src/Documents/InventoryTransferOrder/ManagerModule.bsl
#Region Posting

Function PostingGetDocumentDataTables(Ref, Cancel, PostingMode, Parameters, AddInfo = Undefined) Export
	
	Tables = New Structure();
	QueryArray = GetQueryTextsSecondaryTables();
	Parameters.Insert("QueryParameters", GetAdditionalQueryParamenters(Ref));
	PostingServer.ExecuteQuery(Ref, QueryArray, Parameters);
	Return Tables;
EndFunction

Function PostingGetLockDataSource(Ref, Cancel, PostingMode, Parameters, AddInfo = Undefined) Export
	DataMapWithLockFields = New Map();
	Return DataMapWithLockFields;
EndFunction

Procedure PostingCheckBeforeWrite(Ref, Cancel, PostingMode, Parameters, AddInfo = Undefined) Export
#Region NewRegisterPosting
	If Parameters.StatusInfo.Posting Then
		Tables = Parameters.DocumentDataTables;	
		QueryArray = GetQueryTextsMasterTables();
		PostingServer.SetRegisters(Tables, Ref);
		PostingServer.FillPostingTables(Tables, Ref, QueryArray, Parameters);
	EndIf;
#EndRegion
EndProcedure

Function PostingGetPostingDataTables(Ref, Cancel, PostingMode, Parameters, AddInfo = Undefined) Export
	PostingDataTables = New Map();
	PostingServer.SetPostingDataTables(PostingDataTables, Parameters);
	Return PostingDataTables;
EndFunction

Procedure PostingCheckAfterWrite(Ref, Cancel, PostingMode, Parameters, AddInfo = Undefined) Export
	CheckAfterWrite(Ref, Cancel, Parameters, AddInfo);
EndProcedure

#EndRegion

#Region Undoposting

Function UndopostingGetDocumentDataTables(Ref, Cancel, Parameters, AddInfo = Undefined) Export
	Tables = PostingGetDocumentDataTables(Ref, Cancel, Undefined, Parameters, AddInfo);
	If Parameters.StatusInfo.Posting Then
		QueryArray = GetQueryTextsMasterTables();
		PostingServer.ExecuteQuery(Ref, QueryArray, Parameters);
	EndIf;
	Return Tables;
EndFunction

Function UndopostingGetLockDataSource(Ref, Cancel, Parameters, AddInfo = Undefined) Export
	DataMapWithLockFields = New Map();
	Return DataMapWithLockFields;
EndFunction

Procedure UndopostingCheckBeforeWrite(Ref, Cancel, Parameters, AddInfo = Undefined) Export
	Return;
EndProcedure

Procedure UndopostingCheckAfterWrite(Ref, Cancel, Parameters, AddInfo = Undefined) Export
	Parameters.Insert("Unposting", True);
	CheckAfterWrite(Ref, Cancel, Parameters, AddInfo);
EndProcedure

#EndRegion

#Region CheckAfterWrite

Procedure CheckAfterWrite(Ref, Cancel, Parameters, AddInfo = Undefined)
	Unposting = ?(Parameters.Property("Unposting"), Parameters.Unposting, False);
EndProcedure

#EndRegion

#Region NewRegistersPosting

Function GetInformationAboutMovements(Ref) Export
	Str = New Structure;
	Str.Insert("QueryParamenters", GetAdditionalQueryParamenters(Ref));
	Str.Insert("QueryTextsMasterTables", GetQueryTextsMasterTables());
	Str.Insert("QueryTextsSecondaryTables", GetQueryTextsSecondaryTables());
	Return Str;
EndFunction

Function GetAdditionalQueryParamenters(Ref)	
	StrParams = New Structure();
	StatusInfo = ObjectStatusesServer.GetLastStatusInfo(Ref);
	StrParams.Insert("Period", StatusInfo.Period);
	StrParams.Insert("Ref", Ref);
	Return StrParams;
EndFunction

Function GetQueryTextsSecondaryTables()
	QueryArray = New Array;
	QueryArray.Add(ItemList());
	QueryArray.Add(R4035B_IncomingStocks_Exists());
	Return QueryArray;	
EndFunction

Function GetQueryTextsMasterTables()
	QueryArray = New Array;
	QueryArray.Add(R4011B_FreeStocks());
	QueryArray.Add(R4035B_IncomingStocks());
	QueryArray.Add(R4036B_IncomingStocksRequested());
	QueryArray.Add(R4012B_StockReservation());
	Return QueryArray;	
EndFunction	

Function ItemList()
	Return
		"SELECT
		|	&Period AS Period,
		|	InventoryTransferOrderItemList.Ref.Company AS Company,
		|	InventoryTransferOrderItemList.Ref.StoreSender AS StoreSender,
		|	InventoryTransferOrderItemList.Ref.StoreReceiver AS StoreReceiver,
		|	InventoryTransferOrderItemList.Ref AS Order,
		|	InventoryTransferOrderItemList.InternalSupplyRequest AS InternalSupplyRequest,
		|	InventoryTransferOrderItemList.ItemKey AS ItemKey,
		|	InventoryTransferOrderItemList.QuantityInBaseUnit AS Quantity,
		|	InventoryTransferOrderItemList.Key AS RowKey,
		|	InventoryTransferOrderItemList.PurchaseOrder AS PurchaseOrder,
		|	NOT InventoryTransferOrderItemList.PurchaseOrder.Ref IS NULL AS UsePurchaseOrder
		|INTO ItemList
		|FROM
		|	Document.InventoryTransferOrder.ItemList AS InventoryTransferOrderItemList
		|WHERE
		|	InventoryTransferOrderItemList.Ref = &Ref";
EndFunction	

Function R4011B_FreeStocks()
	Return
		"SELECT
		|	VALUE(AccumulationRecordType.Expense) AS RecordType,
		|	ItemList.Period,
		|	ItemList.StoreSender AS Store,
		|	ItemList.ItemKey,
		|	SUM(ItemList.Quantity) AS Quantity
		|INTO R4011B_FreeStocks
		|FROM
		|	ItemList AS ItemList
		|WHERE
		|	NOT ItemLIst.UsePurchaseOrder
		|GROUP BY
		|	ItemList.Period,
		|	ItemList.StoreSender,
		|	ItemList.ItemKey";
EndFunction 

Function R4035B_IncomingStocks()
	Return
		"SELECT
		|	VALUE(AccumulationRecordType.Expense) AS RecordType,
		|	ItemList.Period,
		|	ItemList.StoreSender AS Store,
		|	ItemList.ItemKey,
		|	ItemList.PurchaseOrder AS Order,
		|	SUM(ItemList.Quantity) AS Quantity
		|INTO R4035B_IncomingStocks
		|FROM
		|	ItemList AS ItemList
		|WHERE
		|	ItemLIst.UsePurchaseOrder
		|GROUP BY
		|	ItemList.Period,
		|	ItemList.StoreSender,
		|	ItemList.ItemKey,
		|	ItemList.PurchaseOrder";
//		|
//		|UNION ALL
//		|
//		|SELECT
//		|	VALUE(AccumulationRecordType.Receipt),
//		|	ItemList.Period,
//		|	ItemList.StoreReceiver,
//		|	ItemList.ItemKey,
//		|	ItemList.Order,
//		|	SUM(ItemList.Quantity)
//		|FROM
//		|	ItemList AS ItemList
//		|GROUP BY
//		|	ItemList.Period,
//		|	ItemList.StoreReceiver,
//		|	ItemList.ItemKey,
//		|	ItemList.Order";	
EndFunction

Function R4036B_IncomingStocksRequested()
	Return
		"SELECT
		|	VALUE(AccumulationRecordType.Receipt) AS RecordType,
		|	ItemList.Period,
		|	ItemList.StoreSender AS IncomingStore,
		|	ItemList.StoreReceiver AS RequesterStore,
		|	ItemList.ItemKey,
		|	ItemList.PurchaseOrder AS Order,
		|	ItemList.Order AS Requester,
		|	SUM(ItemList.Quantity) AS Quantity
		|INTO R4036B_IncomingStocksRequested
		|FROM
		|	ItemList AS ItemList
		|WHERE
		|	ItemList.UsePurchaseOrder
		|GROUP BY
		|	ItemList.Period,
		|	ItemList.StoreSender,
		|	ItemList.StoreReceiver,
		|	ItemList.ItemKey,
		|	ItemList.PurchaseOrder,
		|	ItemList.Order";
EndFunction

Function R4012B_StockReservation()
	Return
		"SELECT
		|	VALUE(AccumulationRecordType.Receipt) AS RecordType,
		|	ItemList.Period,
		|	ItemList.StoreSender AS Store,
		|	ItemList.ItemKey,
		|	ItemList.Order,
		|	SUM(ItemList.Quantity) AS Quantity
		|INTO R4012B_StockReservation
		|FROM 
		|	ItemList AS ItemList
		|WHERE
		|	NOT ItemList.UsePurchaseOrder
		|GROUP BY
		|	ItemList.Period,
		|	ItemList.StoreSender,
		|	ItemList.ItemKey,
		|	ItemList.Order";
EndFunction	
		
Function R4035B_IncomingStocks_Exists()
	Return
		"SELECT *
		|	INTO R4035B_IncomingStocks_Exists
		|FROM
		|	AccumulationRegister.R4035B_IncomingStocks AS R4035B_IncomingStocks
		|WHERE
		|	R4035B_IncomingStocks.Recorder = &Ref";
EndFunction

#EndRegion
